{
    "BubbleSort": {
        "ID": "BubbleSort", 
        "Description": "The infamous Bubble Sort. This is the first sorting algorithm (and often one of the first algorithms, period) that many new programmers, data scientists, computer engineers and the like encounter in their early journies. The idea is simple, easy to implement, yet inefficient: compare each element in the array to every other element, swapping whichever is larger over to the right (assuming we are sorting an ascending order). This causes the largest elements in the array to 'bubble up' and shift to the rightmost section of the array after each iteration.",
        "Pseudocode": {
                "JavaScript": "function bubbleSort(arr) {\n  for (let i = 0; i < arr.length - 1; i++) {\n    for (let j = 0; j < arr.length - i - 1; j++) {\n      if (arr[j] > arr[j + 1]) {\n        [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];\n      }\n    }\n  }\n  return arr;\n}                ",
                "CPP": "void bubbleSort(int arr[], int n) {\n  for (int i = 0; i < n-1; i++) {\n    for (int j = 0; j < n-i-1; j++) {\n      if (arr[j] > arr[j+1]) {\n        swap(arr[j], arr[j+1]);\n      }\n    }\n  }\n}                ",
                "Python": "def bubbleSort(arr):\n  n = len(arr)\n  for i in range(n-1):\n    for j in range(n-i-1):\n      if arr[j] > arr[j+1]:\n        arr[j], arr[j+1] = arr[j+1], arr[j]"
        },
        "Performance": "",
        "FurtherLearning": ""
    },
    "SelectionSort": {
        "ID": "SelectionSort", 
        "Description": "Selection Sort is another quite simple algorithm. It works by repeatedly cycling through the array, each time 'selecting' the smallest element, and placing it at the beginning of the array. It's even more inefficient than Bubble Sort when you take into consideration the best case scenario, since, no matter what, you will have to cycle through the array N times, where N is the size of the array. This act of repeatedly finding the smallest element is computationally expensive, especially as the size of the array increases. In comparison to more efficient sorting algorithms like Merge Sort or Quick Sort, Selection Sort's quadratic time complexity limits its utility for sorting large or frequently updated datasets. However, its straightforward logic and ease of implementation still make it a valuable teaching tool for understanding sorting algorithms.",
        "Pseudocode": {
            "JavaScript": "function selectionSort(arr) {\n  const n = arr.length;\n  for (let i = 0; i < n-1; i++) {\n    let minIndex = i;\n    for (let j = i+1; j < n; j++) {\n      if (arr[j] < arr[minIndex])\n        minIndex = j;\n    }\n    [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];\n  }\n  return arr;\n}",
            "CPP": "void selectionSort(int arr[], int n) {\n  for (int i = 0; i < n-1; i++) {\n    int minIndex = i;\n    for (int j = i+1; j < n; j++) {\n      if (arr[j] < arr[minIndex])\n        minIndex = j;\n    }\n    swap(arr[i], arr[minIndex]);\n  }\n}",
            "Python": "def selectionSort(arr):\n  n = len(arr)\n  for i in range(n-1):\n    minIndex = i\n    for j in range(i+1, n):\n      if arr[j] < arr[minIndex]:\n        minIndex = j\n    arr[i], arr[minIndex] = arr[minIndex], arr[i]"
        },
        "Performance": "",
        "FurtherLearning": ""
    },
    "InsertionSort": {
        "ID": "InsertionSort", 
        "Description": "Insertion Sort is most likely one of the most used sorting algorithms in the real world. Imagine trying to sort a deck of cards. In one hand, you'll keep your sorted cards (starting with 1 single card), and as you inspect new cards in the unsorted deck, you place them into your sorted hand in it's respective position. Insertion Sort operates the same way, wherein we keep track of a sorted array on the left-hand side, inserting new elements into the sorted array as they come. This algorithm is actually quite efficient for arrays of small sizes (Fewer than 10-20 elements), even faster than Logarithmic functions like Quick Sort.",
        "Pseudocode": {
            "JavaScript": "function insertionSort(arr) {\n  const n = arr.length;\n  for (let i = 1; i < n; i++) {\n    let key = arr[i];\n    let j = i - 1;\n    while (j >= 0 && arr[j] > key) {\n      arr[j + 1] = arr[j];\n      j = j - 1;\n    }\n    arr[j + 1] = key;\n  }\n  return arr;\n}",
            "CPP": "void insertionSort(int arr[], int n) {\n  for (int i = 1; i < n; i++) {\n    int key = arr[i];\n    int j = i - 1;\n    while (j >= 0 && arr[j] > key) {\n      arr[j + 1] = arr[j];\n      j = j - 1;\n    }\n    arr[j + 1] = key;\n  }\n}",
            "Python": "def insertionSort(arr):\n  n = len(arr)\n  for i in range(1, n):\n    key = arr[i]\n    j = i - 1\n    while j >= 0 and arr[j] > key:\n      arr[j + 1] = arr[j]\n      j -= 1\n    arr[j + 1] = key"
        },        
        "Performance": "",
        "FurtherLearning": ""
    },
    "QuickSort": {
        "ID": "QuickSort", 
        "Description": "Quick Sort is an efficient and highly performant Logarithmic sorting algorithm, widely utilized in programming language libraries for its exceptional speed, such as Java's Array.sort(). The algorithm operates by strategically selecting a pivot element from the array and partitioning the data. All elements smaller than the pivot are placed to its left, while those larger are positioned to its right. This pivot + sort procedure is then recursively called on the remaining halves of the array, until the entire array is sorted. One interesting note is that there are varying methods for selecting pivots, such as selecting the first element, last element, or a random element. Often times, selecting a random element as the pivot results in the best performance.",
        "Pseudocode": {
            "JavaScript": "",
            "CPP": "",
            "Python": ""
        },
        "Performance": "",
        "FurtherLearning": ""
    },
    "MergeSort": {
        "ID": "MergeSort", 
        "Description": "Merge Sort is the second of our Logarithmic Sorting algorithms, and most likely the most well-known Divide-and-Conquere algorithm. It can be implemented iteratively or recursively, with the recursive methods being more popular. The algorithm recursively divides the given input until we have N subarrays, where N is the size of the initial array. This is our 'divide' step. Then, each subarray is merged and ordered sequentially as the merging process ensues. By the end, we have all of our sorted subarrays merged, to form our sorted array. It's highly efficient, and a joy to visualize as well, as the steps of the Algorithm become apparent as the visualization proceeds. Press 'Sort' to get started :)",
        "Pseudocode": {
            "JavaScript": "",
            "CPP": "",
            "Python": ""
        },
        "Performance": "",
        "FurtherLearning": ""
    },
    "HeapSort": {
        "ID": "HeapSort", 
        "Description": "Heap Sort is the first algorithm many Computer Scientists learn that utilize a separate data structure to accomplish it's sorting: the Heap. The Heap is a tree-based structure that satisfies the Heap property. A Heap is usually implemented as a complete binary tree, where the value of each node is either always greater than or always less than the values of its children, depending on whether it's a Max Heap or a Min Heap. Heaps are primarily used to efficiently implement priority queues, where the highest (or lowest) priority element can be quickly accessed and removed. This is how our Heap Sort method is accomplished. We first form a Heap from the array, and continuously select the top element, insert it into it's respective position, and reform ('Heapify') our Heap.",
        "Pseudocode": {
            "JavaScript": "",
            "CPP": "",
            "Python": ""
        },
        "Performance": "",
        "FurtherLearning": ""
    },
    "TimSort": {
        "ID": "TimSort", 
        "Description": "When thinking of TimSort, think Insertion Sort + Merge Sort. Named after its creator Tim Peters, this algorithm is designed to optimize sorting performance by taking advantage of inherent patterns and runs of already ordered or partially ordered elements in real-world datasets. TimSort begins by dividing the input array into small chunks, and then uses a modified form of insertion sort to sort these chunks, ensuring efficiency for already sorted or nearly sorted portions. The algorithm then performs a merging step, similar to merge sort, to combine the sorted chunks into larger subarrays while maintaining the sorted order. TimSort employs a clever strategy known as 'galloping' to achieve efficient merging by identifying regions where the data is already sorted, significantly reducing the number of comparisons needed. The galloping approach combined with the hybrid nature of TimSort makes it a robust sorting algorithm, often outperforming traditional sorting methods like Quick Sort and Merge Sort, especially for real-world data sets with varying degrees of sortedness.",
        "Pseudocode": {
            "JavaScript": "",
            "CPP": "",
            "Python": ""
        },
        "Performance": "",
        "FurtherLearning": ""
    },
    "RadixSort": {
        "ID": "RadixSort", 
        "Description": "Radix Sort is my personal favorite. Radix Sort is a non-comparative sorting algorithm that operates by distributing elements into buckets based on their individual digits. It processes the digits of the elements from the least significant to the most significant, effectively sorting the elements based on each digit's value. Radix Sort is particularly efficient for sorting integers or strings of the same length, making it a suitable choice for specific data type. Each pass involves distributing the elements into buckets according to the digit being considered, and then collecting them back in the order of the buckets. This process is repeated until all digits have been processed, resulting in a fully sorted array. Radix Sort's time complexity is influenced by the number of digits or characters in the elements being sorted and the range of digits. It often achieves a linear time complexity for integer data types, making it a powerful sorting technique for particular use cases.",
        "Pseudocode": {
            "JavaScript": "",
            "CPP": "",
            "Python": ""
        },
        "Performance": "",
        "FurtherLearning": ""
    }
}
